load-test.yml
config:
  target: "http://localhost:8000"
  phases:
    - duration: 60
      arrivalRate: 5
      name: Warm up
    - duration: 120
      arrivalRate: 20
      name: Sustained load
  plugins:
    ensure: {}
  ensure:
    maxErrorRate: 1

scenarios:
  - flow:
    - get:
        url: "/api/v1/health"
    - get:
        url: "/api/v1/products"